Revit 2027 API
PipePlumbingFixtureFlowData.FixtureUnits Property
 The fixture units of the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FixtureUnits { get; }
Public ReadOnly Property FixtureUnits As Double
	Get
public:
property double FixtureUnits {
	double get ();
}
member FixtureUnits : float with get
Property Value
Double
See Also
Reference
PipePlumbingFixtureFlowData Class
Autodesk.Revit.DB.Plumbing Namespace